Public Attributes | List of all members
API_RailingBalusterType Struct Reference
Element Manager API
Represents a Baluster element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Baluster Set owning this element.
API_Guid  | symbID
The identifier of the symbol of this element.
API_RailingHorizontalPosData  | horizontalPosition
Horizontal alignment of this element.
Detailed Description
Represents a Baluster element.
Member Data Documentation
◆ head
 API_RailingBalusterType::head
General element header.
◆ horizontalPosition
 API_RailingBalusterType::horizontalPosition
Horizontal alignment of this element.
◆ owner
 API_RailingBalusterType::owner
GUID of the Baluster Set owning this element.
◆ symbID
 API_RailingBalusterType::symbID
The identifier of the symbol of this element.